---
kind: method
id: M:Autodesk.Revit.DB.Structure.ReinforcementData.Dispose
source: html/f556ec69-40ef-0f71-6487-e69b4d4075dc.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementData.Dispose Method

Releases all resources used by the ReinforcementData

## Syntax (C#)
```csharp
public void Dispose()
```